app/controllers/posts_controller.rb

  def index
  	@posts = Post.all.order(created_at: :desc)
  	@post = Post.new
    @user = User.find(current_user.id)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

  def create
  	@post = Post.new(post_params)
    @post.user_id = current_user.id

  	if @post.save
      flash[:notice] = "Your post has been completed successfully!"
	    redirect_to post_path(@post.id)
    else
      @user = User.find(current_user.id)
      @posts = Post.where(user_id: @user.id)
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "fff1"], ["body", "fff1"], ["created_at", "2018-06-07 10:21:08.267541"], ["updated_at", "2018-06-07 10:21:08.267541"], ["user_id", 8]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 3]]

  def show
    @new_post = Post.new
  	@post = Post.find(params[:id])
    @user = User.find(@post.user_id)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 34], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
  	@post = Post.find(params[:id])
  	if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "寿司の歴史２"], ["body", "世界に進出した寿司の深化と進化を紐解きます。"], ["updated_at", "2018-06-07 03:42:26.934399"], ["id", 28]]

  def destroy
  	post = Post.find(params[:id])
  	post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 35], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 35]]