app/controllers/users_controller.rb

  def show
  	@user = User.find(params[:id])
  	@posts = Post.where(user_id: @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 4]]

  def index
    @user = User.find(params[:id])
  	@users = User.all.order(created_at: :asc)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."created_at" ASC

  def edit
    @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
    @user = User.find(params[:id])

    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "image_name_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image_name_id", "cda06a3a1868745a70a4c6dc309b287f059994bc9ec8f1c79612874e4ade"], ["updated_at", "2018-06-07 12:49:44.426083"], ["id", 8]]